<details><summary>Show Plan</summary>

```

terraform
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=44]
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.dns.data.aws_route53_zone.hosted_zone: Reading...
data.aws_ecr_repository.repository: Reading...
module.ecs.aws_iam_role_policy_attachment.bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20221201100258896200000001]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket.analytics_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics]
module.ecs.data.aws_vpc.vpc: Reading...
module.ecs.data.aws_ecr_image.service_image: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_kms_key.analytics_bucket: Refreshing state... [id=8df8e26c-8045-4e01-b4a9-a35f64114cb4]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:bf95e511e5dcc412f1b17a4efa38e7c991b5ef5760b2668e0d97c9fea09ffc26]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=45]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z09669243E0Q6ZCWCIW2U]
module.redis.data.aws_vpc.vpc: Reading...
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/proxy/staging]
module.ecs.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.ecs.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.redis.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.redis.data.aws_subnets.private_subnets: Reading...
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0dc8dc9dd50d9922f]
module.redis.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_iam_policy.analytics_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics_bucket_access]
aws_s3_bucket_versioning.analytics_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics]
aws_s3_bucket_server_side_encryption_configuration.analytics_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics]
aws_s3_bucket_public_access_block.analytics_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics]
aws_s3_bucket_acl.analytics_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics,private]
aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake,private]
aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.analytics-data-lake_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "analytics-data-lake_bucket" {
        id                          = "walletconnect.rpc-proxy.staging.analytics.data-lake"
        tags                        = {}
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/8df8e26c-8045-4e01-b4a9-a35f64114cb4" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.analytics_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "analytics_bucket" {
        id                          = "walletconnect.rpc-proxy.staging.analytics"
        tags                        = {}
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/8df8e26c-8045-4e01-b4a9-a35f64114cb4" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:48" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:47" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 47 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access will be created
  + resource "aws_iam_policy" "analytics-data-lake_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows staging_rpc-proxy to read/write from walletconnect.rpc-proxy.staging.analytics.data-lake"
      + id          = (known after apply)
      + name        = "staging_rpc-proxy_analytics-data-lake_bucket_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::walletconnect.rpc-proxy.staging.analytics.data-lake",
                        ]
                      + Sid      = "ListObjectsInAnalyticsBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:DeleteObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                          + "s3:PutObject",
                          + "s3:RestoreObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::walletconnect.rpc-proxy.staging.analytics.data-lake/*",
                        ]
                      + Sid      = "AllObjectActionsInAnalyticsBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",
                        ]
                      + Sid      = "ListObjectsInGeoipBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",
                        ]
                      + Sid      = "AllObjectActionsInGeoipBucket"
                    },
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:eu-central-1:898587786287:key/8df8e26c-8045-4e01-b4a9-a35f64114cb4",
                        ]
                      + Sid      = "AllGenerateDataKeyForAnalyticsBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "analytics-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging_rpc-proxy_ecs_task_execution_role"
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging_rpc-proxy_ecs_task_execution_role"
    }

  # module.ecs.aws_iam_role_policy_attachment.bucket-policy-attach will be destroyed
  # (because aws_iam_role_policy_attachment.bucket-policy-attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "bucket-policy-attach" {
      - id         = "staging_rpc-proxy_ecs_task_execution_role-20221201100258896200000001" -> null
      - policy_arn = "arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics_bucket_access" -> null
      - role       = "staging_rpc-proxy_ecs_task_execution_role" -> null
    }

Plan: 4 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*